import telebot
import random

token = "8508214748:AAErEGMJA3eyD5dXysLSrHuD0Gx_04dbxWk"
bot = telebot.TeleBot(token)

animal_facts = [
    "Жирафы могут чистить свои уши собственным языком, который достигает 50 см в длину!",
    "Слоны - единственные животные, которые не умеют прыгать.",
    "У китов горло размером с грейпфрут, поэтому они не могут проглотить человека.",
    "Белки сажают тысячи деревьев каждый год, просто забывая, где спрятали орехи.",
    "Сердце голубого кита настолько огромно, что через его артерии мог бы проплыть человек.",
    "У улитки около 25 000 зубов, расположенных в виде 'тёрки'.",
    "Колибри - единственная птица, которая умеет летать назад.",
    "У осьминога три сердца и голубая кровь.",
    "Кошки не чувствуют сладкий вкус - у них нет рецепторов для сладкого.",
    "Змеи могут спать до 3 лет подряд без еды.",
    "Глаза страуса больше, чем его мозг.",
    "У креветки сердце расположено в голове.",
    "Бабочки пробуют еду ногами - у них там вкусовые рецепторы.",
    "Вороны настолько умны, что могут запоминать человеческие лица и мстить обидчикам.",
    "У дельфинов есть имена друг для друга - уникальные звуковые сигналы.",
    "Коровы могут подниматься по лестнице, но не могут спускаться.",
    "У морских звёзд нет мозга - вместо этого у них нервные кольца.",
    "Божьи коровки могут выделять ядовитую жидкость из суставов ног при опасности.",
    "Панды проводят до 14 часов в день за едой и съедают до 20 кг бамбука.",
    "У хамелеонов язык может быть в 2 раза длиннее их тела.",
    "Совиные глаза не могут двигаться - вместо этого они поворачивают голову на 270 градусов.",
    "Кенгуру не умеют ходить назад - только вперед и прыжками.",
    "У тасманийского дьявола самое сильное укус среди млекопитающих относительно размера тела.",
    "Зебры спят стоя - так они всегда готовы к бегству от хищников.",
    "У акул нет костей - их скелет состоит из хрящей.",
    "Бегемоты могут бегать быстрее человека на коротких дистанциях.",
    "У пауков прозрачная кровь голубого цвета.",
    "Крокодилы не могут высовывать язык - он прикреплен ко дну пасти.",
    "Ленивцы спускаются с деревьев только раз в неделю - чтобы сходить в туалет.",
    "У фламинго розовый цвет перьев появляется из-за питания креветками и водорослями."
]

@bot.message_handler(commands=["start"])
def start(message):
    bot.send_message(message.chat.id,"Привет! Я бот который рассказывает интересные факты о животныйых. "
                                        "Напиши /facts чтобы получить факты." )

@bot.message_handler(commands=["facts"])
def facts(message):
    selected_facts = random.sample(animal_facts, 3)

    for it in selected_facts:
        bot.send_message(message.chat.id, it)

bot.polling(non_stop=True, interval=0)